Amiya200/stm32_water_tank/Core/Src/screen.c
/* screen.c
   Redesigned 16x2 cursor-based UI with menu + edit flows for:
   Manual, Semi-Auto, Timer, Search, Countdown, Twist
*/

#include "screen.h"
#include "lcd_i2c.h"
#include "switches.h"
#include "model_handle.h"
#include "adc.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"

/* ===== UI Buttons ===== */
typedef enum {
    BTN_NONE = 0,
    BTN_RESET,   // SW1 → Manual Toggle (short) / Restart (long)
    BTN_SELECT,  // SW2
    BTN_UP,      // SW3
    BTN_DOWN     // SW4 → Down / Back (long)
} UiButton;

/* ===== Internal UI States ===== */
typedef enum {
    UI_WELCOME = 0,
    UI_DASH,
    UI_MENU,
    UI_MANUAL,
    UI_SEMI_AUTO,
    UI_TIMER,
    UI_TIMER_SLOT_SELECT,      // new multi-slot entry screen
    UI_TIMER_EDIT_SLOT_ON_H,
    UI_TIMER_EDIT_SLOT_ON_M,
    UI_TIMER_EDIT_SLOT_OFF_H,
    UI_TIMER_EDIT_SLOT_OFF_M,
    UI_TIMER_EDIT_SLOT_ENABLE,
    UI_SEARCH,
    UI_SEARCH_EDIT_GAP,
    UI_SEARCH_EDIT_DRY,
    UI_COUNTDOWN,
    UI_COUNTDOWN_EDIT_MIN,
    UI_COUNTDOWN_TOGGLE,   // NEW: enable/disable screen
    UI_TWIST,
    UI_TWIST_EDIT_ON,
    UI_TWIST_EDIT_OFF,
	UI_SEARCH_EDIT_ON_H,
	UI_SEARCH_EDIT_ON_M,
	UI_SEARCH_EDIT_OFF_H,
	UI_SEARCH_EDIT_OFF_M,
	UI_TWIST_EDIT_ON_H,
	UI_TWIST_EDIT_ON_M,
	UI_TWIST_EDIT_OFF_H,
	UI_TWIST_EDIT_OFF_M,

    UI_MAX_
} UiState;
char buf[17];

/* ===== Timing ===== */
static uint32_t lastLcdUpdateTime = 0;
static const uint32_t WELCOME_MS = 3000;
static const uint32_t CURSOR_BLINK_MS = 500;
static const uint32_t AUTO_BACK_MS = 60000;

/* ===== UI state ===== */
static UiState ui = UI_WELCOME;
static UiState last_ui = UI_MAX_;
static bool screenNeedsRefresh = false;
static bool cursorVisible = true;
static uint32_t lastCursorToggle = 0;
static uint32_t lastUserAction = 0;

/* ===== Externals ===== */
extern ADC_Data adcData;

extern TimerSlot timerSlots[5];
static uint8_t currentSlot = 0;
extern SearchSettings searchSettings;
extern TwistSettings  twistSettings;
extern volatile bool  countdownActive;
extern volatile uint32_t countdownDuration;
extern volatile bool  countdownMode;
extern volatile bool  manualActive;
extern volatile bool  semiAutoActive;
extern volatile bool  timerActive;
extern volatile bool  searchActive;
extern volatile bool  twistActive;
// ---- SEARCH extended params ----
static uint8_t edit_search_on_h = 18;
static uint8_t edit_search_on_m = 30;
static uint8_t edit_search_off_h = 18;
static uint8_t edit_search_off_m = 35;

// ---- TWIST extended params ----
static uint8_t edit_twist_on_hh = 6;
static uint8_t edit_twist_on_mm = 0;
static uint8_t edit_twist_off_hh = 18;
static uint8_t edit_twist_off_mm = 0;

static bool semiAutoEnabled = false;

extern bool Motor_GetStatus(void);

/* ===== Menu definitions ===== */
static const char * const main_menu[] = {
    "Manual Mode",
    "Semi-Auto Mode",
    "Timer Mode",
    "Search Mode",
    "Countdown",
    "Twist Mode",
    "Back to Dash"
};

#define MAIN_MENU_COUNT (sizeof(main_menu)/sizeof(main_menu[0]))

/* ===== Cursor/menu bookkeeping ===== */
static int menu_idx = 0;
static int menu_view_top = 0;

/* ===== Temp edit variables ===== */
static uint8_t  edit_timer_on_h  = 6,  edit_timer_on_m  = 30;
static uint8_t  edit_timer_off_h = 18, edit_timer_off_m = 30;
static uint16_t edit_search_gap_s = 60, edit_search_dry_s = 10;
static uint16_t edit_twist_on_s = 5, edit_twist_off_s = 5;
static uint16_t edit_countdown_min = 5;
// Long press detect for SELECT (SW2)
static uint32_t selectPressStart = 0;
static bool selectLongPressHandled = false;

#define SELECT_LONG_PRESS_MS 3000

/* ===== LCD Helpers ===== */
static inline void lcd_line(uint8_t row, const char* s) {
    char ln[17];
    snprintf(ln, sizeof(ln), "%-16.16s", s);
    lcd_put_cur(row, 0);
    lcd_send_string(ln);
}
static inline void lcd_line0(const char* s){ lcd_line(0,s); }
static inline void lcd_line1(const char* s){ lcd_line(1,s); }

/* ===== Utilities ===== */
static void refreshInactivityTimer(void){ lastUserAction = HAL_GetTick(); }
static void goto_menu_top(void){ menu_idx = 0; menu_view_top = 0; }

/* ===== Helper: format menu line ===== */
static void format_menu_line(char* buf, size_t bufsize, int idx, bool selected){
    if (idx < (int)MAIN_MENU_COUNT && idx >= 0) {
        char prefix = selected ? '>' : ' ';
        char item[16];
        snprintf(item, sizeof(item), "%-15.15s", main_menu[idx]);
        snprintf(buf, bufsize, "%c%s", prefix, item);
    } else {
        snprintf(buf, bufsize, "                ");
    }
}

/* ===== Render functions ===== */
static void show_welcome(void){
    lcd_clear();
    lcd_line0("  Welcome to ");
    lcd_line1("   HELONIX   ");
}

static void show_dash(void) {
    char line0[17], line1[17];
    const char *motor = Motor_GetStatus() ? "ON " : "OFF";

    const char *mode = "IDLE";
    if (manualActive)        mode = "Manual";
    else if (semiAutoActive) mode = "SemiAuto";
    else if (timerActive)    mode = "Timer";
    else if (searchActive) mode = "SEARCH";
    else if (countdownActive)mode = "Countdown";
    else if (twistActive)    mode = "Twist";

    snprintf(line0,sizeof(line0),"M:%s %s",motor,mode);

    int submergedCount = 0;
    for (int i=1; i<6; i++) {
        if (adcData.voltages[i] < 0.1f) submergedCount++;
    }

    const char *level;
    switch (submergedCount) {
        case 0:  level = "00%"; break;
        case 1:  level = "20%";   break;
        case 2:  level = "40%";  break;
        case 3:  level = "60%";   break;
        case 4:  level = "80%";   break;
        default: level = "100%";  break;
    }

    snprintf(line1,sizeof(line1),"Water:%-5s",level);

    lcd_line0(line0);
    lcd_line1(line1);
}

static void show_menu(void){
    char line0[17], line1[17];
    if (menu_idx < menu_view_top) menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top+1) menu_view_top = menu_idx-1;
    format_menu_line(line0,sizeof(line0),menu_view_top,menu_idx==menu_view_top && cursorVisible);
    format_menu_line(line1,sizeof(line1),menu_view_top+1,menu_idx==(menu_view_top+1) && cursorVisible);
    lcd_line0(line0);
    lcd_line1(line1);
}

static void show_manual(void){
    char line0[17], line1[17];
    snprintf(line0,sizeof(line0),"Manual Mode");
    if (Motor_GetStatus()) snprintf(line1,sizeof(line1),">Stop     Back");
    else snprintf(line1,sizeof(line1),">Start    Back");
    lcd_line0(line0);
    lcd_line1(line1);
}

static void show_semi_auto(void){
    char line0[17], line1[17];
    snprintf(line0,sizeof(line0),"Semi-Auto Mode");
    if (semiAutoEnabled) snprintf(line1,sizeof(line1),">Disable  Back");
    else snprintf(line1,sizeof(line1),">Enable   Back");
    lcd_line0(line0);
    lcd_line1(line1);
}

static void show_timer(void)
{
    char l0[17], l1[17];
    TimerSlot *ts = &timerSlots[currentSlot];
    snprintf(l0, sizeof(l0), "T%d %02d:%02d-%02d:%02d",
             currentSlot + 1, ts->onHour, ts->onMinute, ts->offHour, ts->offMinute);
    snprintf(l1, sizeof(l1), "EN:%s  Edit>Next",
             ts->enabled ? "Y" : "N");
    lcd_line0(l0);
    lcd_line1(l1);
}


static void apply_timer_slot(uint8_t slot)
{
    if (slot >= 5) return;
    TimerSlot *ts = &timerSlots[slot];
    ts->onHour    = edit_timer_on_h;
    ts->onMinute  = edit_timer_on_m;
    ts->offHour   = edit_timer_off_h;
    ts->offMinute = edit_timer_off_m;
    ts->enabled   = true;
}

static void show_search(void)
{
    char l0[17], l1[17];
    snprintf(l0, sizeof(l0), "Search Mode");

    // Line 1: Enable/Disable + Edit
    snprintf(l1, sizeof(l1),
             ">%s   Edit",
             searchActive ? "Disable" : "Enable");

