Amiya200/stm32_water_tank/Core/Src/screen.c
            /* ==== TIMER EDITING ==== */
            case UI_TIMER_SLOT_SELECT: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Select Slot:%d", currentSlot + 1);
                snprintf(l1,sizeof(l1),">Edit   Back");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ON_H: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d ON Hour:%02d", currentSlot + 1, edit_timer_on_h);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ON_M: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d ON Min:%02d", currentSlot + 1, edit_timer_on_m);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_OFF_H: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d OFF Hr:%02d", currentSlot + 1, edit_timer_off_h);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_OFF_M: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"T%d OFF Mn:%02d", currentSlot + 1, edit_timer_off_m);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TIMER_EDIT_SLOT_ENABLE: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Enable Slot %d?", currentSlot + 1);
                snprintf(l1,sizeof(l1),">YES=Sel Back");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== SEARCH EDIT SCREENS (FIXED & PROPER) ==== */

            case UI_SEARCH_EDIT_GAP:
            {
                char l0[17], l1[17];
                snprintf(l0, sizeof(l0), "Gap:    %3ds", edit_search_gap_s);
                snprintf(l1, sizeof(l1), ">UpDn   Next");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }

            case UI_SEARCH_EDIT_ON_H:
            {
                char l0[17], l1[17];
                snprintf(l0, sizeof(l0), "ON Hour:   %02d", edit_search_on_h);
                snprintf(l1, sizeof(l1), ">UpDn   Next");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }

            case UI_SEARCH_EDIT_ON_M:
            {
                char l0[17], l1[17];
                snprintf(l0, sizeof(l0), "ON Min:    %02d", edit_search_on_m);
                snprintf(l1, sizeof(l1), ">UpDn   Next");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }

            case UI_SEARCH_EDIT_OFF_H:
            {
                char l0[17], l1[17];
                snprintf(l0, sizeof(l0), "OFF Hour:  %02d", edit_search_off_h);
                snprintf(l1, sizeof(l1), ">UpDn   Next");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }

            case UI_SEARCH_EDIT_OFF_M:
            {
                char l0[17], l1[17];
                snprintf(l0, sizeof(l0), "OFF Min:   %02d", edit_search_off_m);
                snprintf(l1, sizeof(l1), ">Save");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }


            case UI_TWIST_EDIT_ON_H:
                lcd_line0("Twist ON Hour");
                snprintf(buf,16,">%02d", edit_twist_on_hh);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_ON_M:
                lcd_line0("Twist ON Min");
                snprintf(buf,16,">%02d", edit_twist_on_mm);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_OFF_H:
                lcd_line0("Twist OFF Hour");
                snprintf(buf,16,">%02d", edit_twist_off_hh);
                lcd_line1(buf);
                break;

            case UI_TWIST_EDIT_OFF_M:
                lcd_line0("Twist OFF Min");
                snprintf(buf,16,">%02d", edit_twist_off_mm);
                lcd_line1(buf);
                break;


            case UI_SEARCH_EDIT_DRY: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit Dry: %3ds", edit_search_dry_s);
                snprintf(l1,sizeof(l1),">UpDn   Save");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            /* ==== COUNTDOWN ==== */
            case UI_COUNTDOWN_EDIT_MIN: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Set Min: %3u", edit_countdown_min);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_COUNTDOWN_TOGGLE: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Start Countdown?");
                snprintf(l1,sizeof(l1),">Yes     Back");
                lcd_line0(l0);
                lcd_line1(l1);
                break;
            }



            /* ==== TWIST ==== */
            case UI_TWIST_EDIT_ON: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T ON:%3ds", edit_twist_on_s);
                snprintf(l1,sizeof(l1),">UpDn   Next");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            case UI_TWIST_EDIT_OFF: {
                char l0[17], l1[17];
                snprintf(l0,sizeof(l0),"Edit T OFF:%3ds", edit_twist_off_s);
                snprintf(l1,sizeof(l1),">UpDn   Save");
                lcd_line0(l0); lcd_line1(l1);
                break;
            }

            default:
                lcd_line0("Not Implemented");
                lcd_line1("                ");
                break;
        }
    }
}

/* ============================
   BUTTON HANDLER
   ============================ */

/* ============================
   SWITCH POLLING + LONG PRESS
   ============================ */
/* ============================
   SWITCH POLLING + LONG PRESS
   ============================ */
void Screen_HandleSwitches(void) {
  static const struct {
    GPIO_TypeDef* port;
    uint16_t pin;
    UiButton btn;
    uint16_t ledPin;
  } switchMap[] = {
    { SWITCH1_GPIO_Port, SWITCH1_Pin, BTN_RESET, LED1_Pin },   // Manual
    { SWITCH2_GPIO_Port, SWITCH2_Pin, BTN_SELECT, LED2_Pin },  // Select
    { SWITCH3_GPIO_Port, SWITCH3_Pin, BTN_UP, LED3_Pin },      // Up
    { SWITCH4_GPIO_Port, SWITCH4_Pin, BTN_DOWN, LED4_Pin }     // Down / Back
  };

  static bool prev[4] = { true, true, true, true };
  static uint32_t pressStart[4] = { 0, 0, 0, 0 };

