Amiya200/stm32_water_tank/Core/Src/screen.c
  for (int i = 0; i < 4; i++) {
    bool pressed = (HAL_GPIO_ReadPin(switchMap[i].port, switchMap[i].pin) == GPIO_PIN_RESET);

    if (pressed && prev[i]) {
      prev[i] = false;
      pressStart[i] = HAL_GetTick();
    } else if (!pressed && !prev[i]) {
      uint32_t pressDuration = HAL_GetTick() - pressStart[i];
      prev[i] = true;

      /* ---- SW3 ≥3s => "Summer Save" burst ---- */
      if (i == 2 && pressDuration >= 3000UL) {
        ModelHandle_TriggerAuxBurst(30);
        lcd_clear();
        lcd_put_cur(0, 0);
        lcd_send_string("Summer Save 30s");
        lcd_put_cur(1, 0);
        lcd_send_string("Relays 2&3 ON");
        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
      }

      /* ---- SW1 ≥2s => System reset ---- */
      else if (i == 0 && pressDuration > 2000UL) {
        ModelHandle_ManualLongPress();
      }

      /* ---- SW4 ≥2s => Back/menu reset ---- */
      else if (i == 3 && pressDuration > 2000UL) {
        menu_reset();
      }

      /* ---- SW2 (SELECT) short vs long ---- */
      /* ---- SW2 (SELECT) short vs long ---- */
      else if (i == 1) {
        /* ========== LONG PRESS (ENABLE/DISABLE) ========== */
        if (pressDuration >= 3000UL) {
          /* TIMER → slot select */
          if (ui == UI_TIMER) {
            ui = UI_TIMER_SLOT_SELECT;
            screenNeedsRefresh = true;
          }

          /* SEARCH ON/OFF */
          else if (ui == UI_SEARCH) {
            if (!searchActive) {
              ModelHandle_StartSearch(
                searchSettings.gapSeconds,
                searchSettings.probeSeconds,
                searchSettings.onHour,
                searchSettings.onMinute,
                searchSettings.offHour,
                searchSettings.offMinute);
            } else {
              ModelHandle_StopSearch();
            }

            screenNeedsRefresh = true;
          }

          /* TWIST ON/OFF */
          else if (ui == UI_TWIST) {
            if (!twistActive) {
              ModelHandle_StartTwist(
                twistSettings.onDurationSeconds,
                twistSettings.offDurationSeconds,
                twistSettings.onHour,
                twistSettings.onMinute,
                twistSettings.offHour,
                twistSettings.offMinute);
            } else {
              ModelHandle_StopTwist();
            }

            screenNeedsRefresh = true;
          }
        }

        /* ========== SHORT PRESS (EDIT MODE) ========== */
        else {
          Screen_HandleButton(switchMap[i].btn);
        }

        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
      }

      /* ---- Short press default ---- */
      else {
        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
        Screen_HandleButton(switchMap[i].btn);
      }
    }
  }
}

/* ============================
   BUTTON HANDLER  (FIXED)
   ============================ */void Screen_HandleButton(UiButton b)
   {
       if (b == BTN_NONE) return;
       refreshInactivityTimer();

       /* ===========================
          SW1 SHORT → MANUAL TOGGLE
          =========================== */
       if (b == BTN_RESET) {
           ModelHandle_ToggleManual();
           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ======================= UP KEY ========================
          ====================================================== */
       if (b == BTN_UP)
       {
           switch (ui)
           {
               /* -------- MENU -------- */
               case UI_MENU:
                   if (menu_idx > 0) menu_idx--;
                   break;

               /* -------- TIMER MODE -------- */
               case UI_TIMER:
                   currentSlot = (currentSlot < 4) ? currentSlot + 1 : 0;
                   break;

               case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  < 23) edit_timer_on_h++;  break;
               case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  < 59) edit_timer_on_m++;  break;
               case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h < 23) edit_timer_off_h++; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m < 59) edit_timer_off_m++; break;

               /* -------- SEARCH EDITING -------- */
               case UI_SEARCH_EDIT_GAP:     if (edit_search_gap_s < 999) edit_search_gap_s++; break;
               case UI_SEARCH_EDIT_DRY:     if (edit_search_dry_s < 999) edit_search_dry_s++; break;
               case UI_SEARCH_EDIT_ON_H:    if (edit_search_on_h < 23)   edit_search_on_h++;  break;
               case UI_SEARCH_EDIT_ON_M:    if (edit_search_on_m < 59)   edit_search_on_m++;  break;
               case UI_SEARCH_EDIT_OFF_H:   if (edit_search_off_h < 23)  edit_search_off_h++; break;
               case UI_SEARCH_EDIT_OFF_M:   if (edit_search_off_m < 59)  edit_search_off_m++; break;

               /* -------- COUNTDOWN EDIT -------- */
               case UI_COUNTDOWN_EDIT_MIN:  edit_countdown_min++; break;

               /* -------- TWIST EDIT -------- */
               case UI_TWIST_EDIT_ON:       if (edit_twist_on_s  < 999) edit_twist_on_s++;  break;
               case UI_TWIST_EDIT_OFF:      if (edit_twist_off_s < 999) edit_twist_off_s++; break;

               case UI_TWIST_EDIT_ON_H:     if (edit_twist_on_hh < 23) edit_twist_on_hh++;  break;
               case UI_TWIST_EDIT_ON_M:     if (edit_twist_on_mm < 59) edit_twist_on_mm++;  break;
               case UI_TWIST_EDIT_OFF_H:    if (edit_twist_off_hh < 23) edit_twist_off_hh++; break;
               case UI_TWIST_EDIT_OFF_M:    if (edit_twist_off_mm < 59) edit_twist_off_mm++; break;

               default: break;
           }

           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ===================== DOWN KEY ========================
          ====================================================== */
       if (b == BTN_DOWN)
       {
           switch (ui)
           {
               case UI_MENU:
                   if (menu_idx < (MAIN_MENU_COUNT - 1)) menu_idx++;
                   break;

               case UI_TIMER:
                   currentSlot = (currentSlot > 0) ? currentSlot - 1 : 4;
                   break;

