Amiya200/stm32_water_tank/Core/Src/screen.c
               case UI_TIMER_EDIT_SLOT_ON_H:  if (edit_timer_on_h  > 0) edit_timer_on_h--;  break;
               case UI_TIMER_EDIT_SLOT_ON_M:  if (edit_timer_on_m  > 0) edit_timer_on_m--;  break;
               case UI_TIMER_EDIT_SLOT_OFF_H: if (edit_timer_off_h > 0) edit_timer_off_h--; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: if (edit_timer_off_m > 0) edit_timer_off_m--; break;

               case UI_SEARCH_EDIT_GAP:     if (edit_search_gap_s > 1) edit_search_gap_s--; break;
               case UI_SEARCH_EDIT_DRY:     if (edit_search_dry_s > 1) edit_search_dry_s--; break;
               case UI_SEARCH_EDIT_ON_H:    if (edit_search_on_h > 0) edit_search_on_h--;    break;
               case UI_SEARCH_EDIT_ON_M:    if (edit_search_on_m > 0) edit_search_on_m--;    break;
               case UI_SEARCH_EDIT_OFF_H:   if (edit_search_off_h > 0) edit_search_off_h--;  break;
               case UI_SEARCH_EDIT_OFF_M:   if (edit_search_off_m > 0) edit_search_off_m--;  break;

               case UI_COUNTDOWN_EDIT_MIN:  if (edit_countdown_min > 1) edit_countdown_min--; break;

               case UI_TWIST_EDIT_ON:       if (edit_twist_on_s  > 1) edit_twist_on_s--;  break;
               case UI_TWIST_EDIT_OFF:      if (edit_twist_off_s > 1) edit_twist_off_s--; break;

               case UI_TWIST_EDIT_ON_H:     if (edit_twist_on_hh > 0) edit_twist_on_hh--;    break;
               case UI_TWIST_EDIT_ON_M:     if (edit_twist_on_mm > 0) edit_twist_on_mm--;    break;
               case UI_TWIST_EDIT_OFF_H:    if (edit_twist_off_hh > 0) edit_twist_off_hh--;  break;
               case UI_TWIST_EDIT_OFF_M:    if (edit_twist_off_mm > 0) edit_twist_off_mm--;  break;

               default: break;
           }

           screenNeedsRefresh = true;
           return;
       }


       /* ======================================================
          ===================== SELECT KEY ======================
          ====================================================== */
       if (b == BTN_SELECT)
       {
           switch (ui)
           {
               /* ----- TIMER FLOW ------ */
               case UI_TIMER:                 ui = UI_TIMER_SLOT_SELECT; break;
               case UI_TIMER_SLOT_SELECT:     ui = UI_TIMER_EDIT_SLOT_ON_H; break;
               case UI_TIMER_EDIT_SLOT_ON_H:  ui = UI_TIMER_EDIT_SLOT_ON_M; break;
               case UI_TIMER_EDIT_SLOT_ON_M:  ui = UI_TIMER_EDIT_SLOT_OFF_H; break;
               case UI_TIMER_EDIT_SLOT_OFF_H: ui = UI_TIMER_EDIT_SLOT_OFF_M; break;
               case UI_TIMER_EDIT_SLOT_OFF_M: ui = UI_TIMER_EDIT_SLOT_ENABLE; break;

               case UI_TIMER_EDIT_SLOT_ENABLE:
                   apply_timer_slot(currentSlot);
                   ui = UI_TIMER;
                   break;

               /* ----- SEARCH FLOW ------ */
               case UI_SEARCH: ui = UI_SEARCH_EDIT_GAP; break;
               case UI_SEARCH_EDIT_GAP:  ui = UI_SEARCH_EDIT_DRY; break;
               case UI_SEARCH_EDIT_DRY:  ui = UI_SEARCH_EDIT_ON_H; break;
               case UI_SEARCH_EDIT_ON_H: ui = UI_SEARCH_EDIT_ON_M; break;
               case UI_SEARCH_EDIT_ON_M: ui = UI_SEARCH_EDIT_OFF_H; break;
               case UI_SEARCH_EDIT_OFF_H:ui = UI_SEARCH_EDIT_OFF_M; break;

               case UI_SEARCH_EDIT_OFF_M:
                   apply_search_settings();

                   // 🔥 ENABLE SEARCH MODE EXACTLY LIKE UART
                   ModelHandle_StartSearch(
                       searchSettings.gapSeconds,
                       searchSettings.probeSeconds,
                       searchSettings.onHour,
                       searchSettings.onMinute,
                       searchSettings.offHour,
                       searchSettings.offMinute
                   );

                   ui = UI_SEARCH;
                   screenNeedsRefresh = true;
                   break;


               /* ----- TWIST FLOW ------ */
               case UI_TWIST: ui = UI_TWIST_EDIT_ON; break;
               case UI_TWIST_EDIT_ON:        ui = UI_TWIST_EDIT_OFF; break;
               case UI_TWIST_EDIT_OFF:       ui = UI_TWIST_EDIT_ON_H; break;
               case UI_TWIST_EDIT_ON_H:      ui = UI_TWIST_EDIT_ON_M; break;
               case UI_TWIST_EDIT_ON_M:      ui = UI_TWIST_EDIT_OFF_H; break;
               case UI_TWIST_EDIT_OFF_H:     ui = UI_TWIST_EDIT_OFF_M; break;

               case UI_TWIST_EDIT_OFF_M:
                   apply_twist_settings();
                   ModelHandle_StartTwist(
                       twistSettings.onDurationSeconds,
                       twistSettings.offDurationSeconds,
                       twistSettings.onHour,
                       twistSettings.onMinute,
                       twistSettings.offHour,
                       twistSettings.offMinute
                   );
                   ui = UI_TWIST;
                   break;

               /* ----- COUNTDOWN FLOW ------ */
               case UI_COUNTDOWN:
                   if (countdownActive) ModelHandle_StopCountdown();
                   else ui = UI_COUNTDOWN_EDIT_MIN;
                   break;

               case UI_COUNTDOWN_EDIT_MIN: ui = UI_COUNTDOWN_TOGGLE; break;

               case UI_COUNTDOWN_TOGGLE:
                   apply_countdown_settings();
                   ModelHandle_StartCountdown(edit_countdown_min * 60, 1);
                   ui = UI_COUNTDOWN;
                   break;

               /* ----- DEFAULT MENU ------ */
               default:
                   menu_select();
                   break;
           }

           screenNeedsRefresh = true;
           return;
       }
   }
